In [1]:
import pandas as pd

# 예시 데이터프레임: 팀 별 점수
data = {'Team': ['Red', 'Blue', 'Red', 'Blue'],
        'Score': [5, 3, 8, 7],
        'Passion' : [95, 88, 63, 98]}
df = pd.DataFrame(data)
print("원본 데이터프레임:\n", df)

원본 데이터프레임:
    Team  Score  Passion
0   Red      5       95
1  Blue      3       88
2   Red      8       63
3  Blue      7       98

In [2]:
##그룹별 합계
# # Team별 Score 합계
grouped_sum = df.groupby('Team')['Score'].sum()     #팀별로 점수를
print("팀별 점수 합계:\n", grouped_sum)

팀별 점수 합계:
 Team
Blue    10
Red     13
Name: Score, dtype: int64

In [3]:
##그룹별 평균
grouped_mean = df.groupby('Team')['Score'].mean()
print("팀별 점수 평균:\n", grouped_mean)

팀별 점수 평균:
 Team
Blue    5.0
Red     6.5
Name: Score, dtype: float64

In [4]:
##다중 집계
multi_agg = df.groupby('Team').agg(
    Score_sum=('Score', 'sum'), #Score에 대한 합
    Score_mean=('Score', 'mean'),   #Score에 대한 평균
    Passion_sum=('Passion', 'sum'), #passion에 대한 합
    Passion_mean=('Passion', 'mean')    #passion에 대한 평균
)
print("팀별 점수/열정 평균과 합계:\n", multi_agg)

팀별 점수/열정 평균과 합계:
       Score_sum  Score_mean  Passion_sum  Passion_mean
Team
Blue         10         5.0          186          93.0
Red          13         6.5          158          79.0

In [5]:
titanic_df = pd.read_csv("train.csv")
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
#객실등급(Pclass)에 따른 평균 요금(Fare) 

titanic_df.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [7]:
titanic_df['Survived'].value_counts()   #너가뭔지일단봐야겠어

Survived
0    549
1    342
Name: count, dtype: int64

In [8]:
#성별(Sex)에 따른 생존률 – 남성과 여성 승객의 생존률(생존자 비율)
titanic_df.groupby('Sex')['Survived'].mean()    #

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [9]:
#복수 기준 그룹화 – 객실등급(Pclass)과 성별(Sex) 두 가지 기준으로 그룹을 나눈 뒤 생존률을 계산
titanic_df.groupby(['Pclass', 'Sex'])['Survived'].mean()

#결과 : 멀티인덱스(Series임)

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [10]:
titanic_df.groupby(['Pclass', 'Sex']).agg(
    aaa = ('Pclass', 'mean'),
    bbb = ('Pclass', 'sum'),
    ccc = ('Fare', 'mean'),
    ddd = ('Fare', 'sum'),
    eee = ('Fare', 'count')
)

               aaa   bbb         ccc        ddd  eee
Pclass Sex
1      female  1.0    94  106.125798  9975.8250   94
       male    1.0   122   67.226127  8201.5875  122
2      female  2.0   152   21.970121  1669.7292   76
       male    2.0   216   19.741782  2132.1125  108
3      female  3.0   432   16.118810  2321.1086  144
       male    3.0  1041   12.661633  4393.5865  347

In [11]:
titanic_df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [12]:
#Transform
# 등급별 평균 요금
class_mean_fare = titanic_df.groupby("Pclass")["Fare"].mean()

# 등급별 평균 요금을 각 행마다(각 행의 등급마다) 보여줌
class_mean_fare_transform = titanic_df.groupby("Pclass")["Fare"].transform("mean")
class_mean_fare_transform

0      13.675550
1      84.154687
2      13.675550
3      84.154687
4      13.675550
         ...
886    20.662183
887    84.154687
888    13.675550
889    84.154687
890    13.675550
Name: Fare, Length: 891, dtype: float64

In [13]:
titanic_df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [14]:
# 등급별 평균 요금
class_mean_fare = titanic_df.groupby("Pclass")["Fare"].transform("mean")

# 평균 대비 비율
titanic_df["class_mean_fare_transform"] = titanic_df["Fare"] / class_mean_fare
titanic_df[["Pclass", "Fare", "class_mean_fare_transform"]].head()

   Pclass     Fare  class_mean_fare_transform
0       3   7.2500                   0.530143
1       1  71.2833                   0.847051
2       3   7.9250                   0.579501
3       1  53.1000                   0.630981
4       3   8.0500                   0.588642

In [15]:
#Pcalss랑 Sex별로 Age를 묶을 건데, 전체 행에 대해서 중앙값을 먼저 채울 거야
age_group_median = titanic_df.groupby(["Pclass", "Sex"])["Age"].transform("median")

titanic_df["Age"] = titanic_df["Age"].fillna(age_group_median)

In [16]:
age_group_median

0      25.0
1      35.0
2      21.5
3      35.0
4      25.0
       ...
886    30.0
887    35.0
888    21.5
889    40.0
890    25.0
Name: Age, Length: 891, dtype: float64

In [17]:
titanic_df.loc[0]

PassengerId                                        1
Survived                                           0
Pclass                                             3
Name                         Braund, Mr. Owen Harris
Sex                                             male
Age                                             22.0
SibSp                                              1
Parch                                              0
Ticket                                     A/5 21171
Fare                                            7.25
Cabin                                            NaN
Embarked                                           S
class_mean_fare_transform                   0.530143
Name: 0, dtype: object

In [18]:
surv_table = (
    titanic_df.groupby(["Pclass","Sex"])["Survived"].mean()
    .unstack()
)
surv_table

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [19]:
#위랑 똑같음 

titanic_df.groupby(['Pclass', 'Sex'])['Survived'].mean().unstack()

#결과 : df임

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

이제 결과는

- 행(index) = Pclass
- 열(columns) = Sex
- 값(values) = 생존률
    
    로 딱 **보고서용 표**가 된다.

In [20]:
titanic_df.groupby(['Pclass', 'Sex'])['Survived'].mean().unstack(fill_value=0)
#값이 없으면 뭘로 대체할래?

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [21]:
titanic_df.groupby(['Pclass', 'Sex'])['Survived'].mean().unstack(level=0)
#뭘 올릴래?

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [22]:
#Pclass × Embarked 생존률 표(Dataframe)를 만들고, 빈 조합은 0으로 채워라.
titanic_df.groupby(['Pclass', 'Embarked'])['Survived'].mean().unstack(fill_value=0)

titanic_df.groupby(['Pclass', 'Embarked'])['Survived'].mean().unstack(fill_value=0, level=0)

Pclass           1         2         3
Embarked
C         0.694118  0.529412  0.378788
Q         0.500000  0.666667  0.375000
S         0.582677  0.463415  0.189802

In [23]:
# Series로 닷 ㅣ바꿔
titanic_df.groupby(['Pclass', 'Embarked'])['Survived'].mean().unstack(fill_value=0, level=0).stack()

Embarked  Pclass
C         1         0.694118
          2         0.529412
          3         0.378788
Q         1         0.500000
          2         0.666667
          3         0.375000
S         1         0.582677
          2         0.463415
          3         0.189802
dtype: float64

와이드와 롱 (이름같다..)

In [24]:
sales_wide = pd.DataFrame({
    "Name": ["Kim", "Lee"],
    "Jan": [100, 200],
    "Feb": [120, 210],
    "Mar": [130, 190],
})

sales_wide

  Name  Jan  Feb  Mar
0  Kim  100  120  130
1  Lee  200  210  190

In [25]:
#melt

sales_long = sales_wide.melt(
    id_vars=["Name"],   # id 바~ (식별자 컬럼) (식별자 컬럼은 유지하고, 나머지는 행으로 내림)
    var_name="Month",   # 바 이름
    value_name="Sales"  # value 이름~(해당 컬럼들을 어떤 컬럼으로 부를 건지)
)
sales_long

  Name Month  Sales
0  Kim   Jan    100
1  Lee   Jan    200
2  Kim   Feb    120
3  Lee   Feb    210
4  Kim   Mar    130
5  Lee   Mar    190

In [26]:
#pivot (중복 없어야 함)

sales_wide_back = sales_long.pivot(index="Name", columns="Month", values="Sales")
sales_wide_back

Month  Feb  Jan  Mar
Name
Kim    120  100  130
Lee    210  200  190

In [27]:
#pivot_table (중복 있으면 집계함) (중복 문제 때문에 얘를 자주씀)

sales_long_dup = pd.DataFrame({
    "Name": ["Kim", "Kim", "Lee"],
    "Month": ["Jan", "Jan", "Jan"],
    "Sales": [100, 50, 200]
})

# pivot은 (Name, Month)가 중복이라 곤란할 수 있음
# pivot_table은 aggfunc로 처리 가능
pt = sales_long_dup.pivot_table(
    index="Name",
    columns="Month",
    values="Sales",
    aggfunc="sum",      # 합계로 집계 (한사람이 거래를 두번한거라 (이런건 잘 생각해서 결정))
    fill_value=0
)
pt

Month  Jan
Name
Kim    150
Lee    200

In [28]:
# Pclass × Sex 생존률 표를 만들어라.
titanic_pivot = titanic_df.pivot_table(
    values="Survived",
    index="Pclass",
    columns="Sex",
    aggfunc="mean"
)
titanic_pivot

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [29]:
titanic_df.groupby(['Pclass', 'Sex'])['Survived'].mean().unstack()

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [30]:
result = titanic_df.pivot_table(
    values="Survived",
    index="Pclass",
    columns="Sex",
    aggfunc="mean"
)
result

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [31]:
#위 피벗 표를 다시 long으로 바꿔서 그래프용 데이터 만들어라. (melt - 식별자:Pcalss)
titanic_pivot_long = (
    result
    .reset_index()      ###### reset_index() 를 해줘야만 합니다
    .melt(id_vars="Pclass", var_name="Sex", value_name="SurvivalRate")
)
titanic_pivot_long.head()

   Pclass     Sex  SurvivalRate
0       1  female      0.968085
1       2  female      0.921053
2       3  female      0.500000
3       1    male      0.368852
4       2    male      0.157407

In [32]:
#### 문자열 처리
import pandas as pd

names = pd.Series(['Alice', ' Bob ', 'Charlie'])
print("원본 시리즈:\n", names)

원본 시리즈:
 0      Alice
1       Bob
2    Charlie
dtype: object

In [33]:
#소문자/대문자 변환: 모든 이름을 소문자로 또는 대문자로 변환
print("모든 이름 소문자:\n", names.str.lower())
print("모든 이름 대문자:\n", names.str.upper())

모든 이름 소문자:
 0      alice
1       bob
2    charlie
dtype: object
모든 이름 대문자:
 0      ALICE
1       BOB
2    CHARLIE
dtype: object

In [34]:
#공백 제거: ' Bob '처럼 양쪽에 불필요한 공백이 있는 경우 .strip()으로 제거
print("양쪽 공백 제거:\n", names.str.strip())

양쪽 공백 제거:
 0      Alice
1        Bob
2    Charlie
dtype: object

In [35]:
#문자열 길이 계산: 각 이름의 글자 수 계산 (공백 제외 기준)
print("이름 길이:\n", names.str.strip().str.len())

이름 길이:
 0    5
1    3
2    7
dtype: int64

In [36]:
#부분 문자열 찾기: 예를 들어 이름에 "li"가 들어가는지 확인
print("li 포함 여부:\n", names.str.contains("li"))

li 포함 여부:
 0     True
1    False
2     True
dtype: bool

In [37]:
#split 분할: introduce에서 이름 
names = pd.DataFrame({
	"Name":['Alice', ' Bob ', 'Charlie'],   #Name df임
	"Age": [22, 25, 36],
	'introduce':['hello. Alice', 'hello. Bob', 'hello. Charlie']})

print(names['introduce'].str.split('.').str[1]) #introduce 추가해줘야함

0       Alice
1         Bob
2     Charlie
Name: introduce, dtype: object

In [38]:
names['introduce'].str.split('.').str[1]

0       Alice
1         Bob
2     Charlie
Name: introduce, dtype: object

In [39]:
names['introduce'].str.split('.')[1]

['hello', ' Bob']

In [40]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,class_mean_fare_transform
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.530143
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0.847051
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.579501
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.630981
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.588642

In [41]:
#승객 이름에서 성(last name) 추출

titanic_df['LastName'] = titanic_df['Name'].str.split('.').str[1]
titanic_df[['Name', 'LastName']].head()

,Name,LastName
0,"Braund, Mr. Owen Harris",Owen Harris
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",John Bradley (Florence Briggs Thayer)
2,"Heikkinen, Miss. Laina",Laina
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Jacques Heath (Lily May Peel)
4,"Allen, Mr. William Henry",William Henry

In [42]:
# 특정 문자열 포함 여부로 데이터 필터링
#미혼 여성(Miss.) 승객이 몇 명인지 확인

whoisMiss = titanic_df['Name'].str.contains('Miss.')
titanic_df.loc[whoisMiss]       #.loc로 보면 됨

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,class_mean_fare_transform,LastName
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.579501,Laina
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,1.221157,Marguerite Rut
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,0.315490,Elizabeth
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,0.574324,Hulda Amanda Adolfina
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q,0.587121,"Anna ""Annie"""
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C,0.670708,Asuncion
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,0.528315,"Adele Kiamie ""Jane"""
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,0.769015,Gerda Ulrika
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0.356486,Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21.5,1,2,W./C. 6607,23.4500,NaN,S,1.714739,"Catherine Helen ""Carrie"""

In [43]:
whoisMiss = titanic_df['Name'].str.contains('Miss.')
miss_df = titanic_df.loc[whoisMiss]     
len(miss_df) #개수만 보려면

182

In [44]:
#또는
titanic_df['Name'].str.contains('Miss.').sum()

np.int64(182)

In [45]:
#####시간 데이터 처리

In [46]:
import pandas as pd

date_strings = pd.Series(['2025-01-01', '2025-03-15', '2025-03-31'])
print("문자열 형태 날짜:\n", date_strings)

문자열 형태 날짜:
 0    2025-01-01
1    2025-03-15
2    2025-03-31
dtype: object

In [47]:
#문자열을 datetime으로 변환: pd.to_datetime 사용
dates = pd.to_datetime(date_strings, errors='coerce')   #errors='coerce' 해주기
dates
print("datetime 형태:\n", dates)
print("데이터 타입:", dates.dtype)

datetime 형태:
 0   2025-01-01
1   2025-03-15
2   2025-03-31
dtype: datetime64[ns]
데이터 타입: datetime64[ns]

In [48]:
#연/월/일 추출: .dt 접근자를 사용
print("연도:", dates.dt.year)
print("월:", dates.dt.month)
print("일:", dates.dt.day)
print("날짜:", dates.dt.date)

연도: 0    2025
1    2025
2    2025
dtype: int32
월: 0    1
1    3
2    3
dtype: int32
일: 0     1
1    15
2    31
dtype: int32
날짜: 0    2025-01-01
1    2025-03-15
2    2025-03-31
dtype: object

In [49]:
#날짜 연산: 첫 번째 날짜와 마지막 날짜의 차이
diff = dates.iloc[2] - dates.iloc[0]    #일자가 나옴 오 연산이 가능하구나...
print("첫 번째와 마지막 날짜 차이:", diff)
print("차이 타입:", type(diff))

첫 번째와 마지막 날짜 차이: 89 days 00:00:00
차이 타입: <class 'pandas._libs.tslibs.timedeltas.Timedelta'>

In [50]:
######### titanic 실습
# Embarked 값에 따른 탑승 일시 매핑
embark_to_time = {'S': '1912-04-10 12:00:00',
                  'C': '1912-04-10 18:00:00',
                  'Q': '1912-04-11 12:00:00'}
# BoardTime 열 추가 (현재는 문자열 상태)
titanic_df['BoardTime'] = titanic_df['Embarked'].map(embark_to_time)
print(titanic_df[['Embarked', 'BoardTime']].head(3))

  Embarked            BoardTime
0        S  1912-04-10 12:00:00
1        C  1912-04-10 18:00:00
2        S  1912-04-10 12:00:00

In [51]:
#BoardTime 컬럼 datetime 변환 – 탑승 시간 컬럼인 BoardTime을  datetime 타입으로 변환
titanic_df['BoardTime'] = pd.to_datetime(titanic_df['BoardTime'])   #errors='coerce' 해주기
titanic_df['BoardTime'].dtype

dtype('<M8[ns]')

In [52]:
#최초/마지막 탑승 시간 확인
titanic_df['BoardTime'].max()
titanic_df['BoardTime'].min()

#날짜별 탑승 인원 집계: 날짜(일 단위-dt.date)별로 몇 명이 탑승했는지 계산
titanic_df['BoardDate'] = titanic_df['BoardTime'].dt.date
titanic_df['BoardDate'].value_counts()

BoardDate
1912-04-10    812
1912-04-11     77
Name: count, dtype: int64

In [53]:
# 각 승객의 탑승 시각 - 최초 탑승 시각
titanic_df['TimeSinceFirst'] = titanic_df['BoardTime'] - titanic_df['BoardTime'].min()
print(titanic_df[['Embarked','BoardTime','TimeSinceFirst']].head(5))

# TimeSinceFirst를 시간 단위로 환산 (초 단위로 나와있는 timedelta를 3600으로 나눠 시간으로 변환)
titanic_df['HoursSinceFirst'] = titanic_df['TimeSinceFirst'].dt.total_seconds() / 3600
print(titanic_df[['Embarked','HoursSinceFirst']].head(5))

  Embarked           BoardTime  TimeSinceFirst
0        S 1912-04-10 12:00:00 0 days 00:00:00
1        C 1912-04-10 18:00:00 0 days 06:00:00
2        S 1912-04-10 12:00:00 0 days 00:00:00
3        S 1912-04-10 12:00:00 0 days 00:00:00
4        S 1912-04-10 12:00:00 0 days 00:00:00
  Embarked  HoursSinceFirst
0        S              0.0
1        C              6.0
2        S              0.0
3        S              0.0
4        S              0.0

In [54]:
import pandas as pd

s = pd.Series([10, 20, 30])
print("원본 Series:\n", s)

원본 Series:
 0    10
1    20
2    30
dtype: int64

apply / map / lambda 활용

In [55]:
#Series.map 예제: 값을 간단히 다른 값으로 치환
# 딕셔너리를 이용하여 값 매핑: 10->'A', 20->'B', 30->'C'
mapped = s.map({10: 'A', 20: 'B', 30: 'C'})
print("map 결과:\n", mapped)

map 결과:
 0    A
1    B
2    C
dtype: object

In [56]:
#Series.apply + lambda 예제: 각 값에 임의의 연산 적용
# 각 값에 5를 더하고 문자열로 변환하는 lambda 함수 적용
applied = s.apply(lambda x: str(x + 5))
print("apply 결과:\n", applied)
print("apply 결과 타입:", applied.dtype)

apply 결과:
 0    15
1    25
2    35
dtype: object
apply 결과 타입: object

In [57]:
#DataFrame.apply 예제: 각 행(row)에 대해 연산 적용
df = pd.DataFrame({'A': [1,2,3], 'B': [10, 20, 30]})
print("원본 DF:\n", df)

# 각 행별 합계를 계산하여 시리즈로 반환 (axis=1)
row_sum = df.apply(lambda row: row['A'] + row['B'], axis=1)
print("각 행의 A+B 합:\n", row_sum)

# 이 결과를 새로운 열로 추가할 수도 있음
df['A+B'] = row_sum
print("새 열 추가 후 DF:\n", df)

원본 DF:
    A   B
0  1  10
1  2  20
2  3  30
각 행의 A+B 합:
 0    11
1    22
2    33
dtype: int64
새 열 추가 후 DF:
    A   B  A+B
0  1  10   11
1  2  20   22
2  3  30   33

In [58]:
#map을 사용한 값 치환 

# Survived: 0->'사망', 1->'생존'으로 매핑하여 새로운 열 생성
titanic_df['SurvivalStatus'] = titanic_df['Survived'].map({0: '사망', 1: '생존'})
print(titanic_df[['Survived', 'SurvivalStatus']].head(5))

   Survived SurvivalStatus
0         0             사망
1         1             생존
2         1             생존
3         1             생존
4         0             사망

In [59]:
#apply와 lambda를 사용한 나이대 분류

# 나이가 18 미만이면 '미성년자', 아니면 '성인'으로 분류하는 lambda 함수 적용
titanic_df['AgeGroup'] = titanic_df['Age'].apply(lambda x: '미성년자' if x < 18 else '성인')
print(titanic_df[['Age', 'AgeGroup']].head(10))

    Age AgeGroup
0  22.0       성인
1  38.0       성인
2  26.0       성인
3  35.0       성인
4  35.0       성인
5  25.0       성인
6  54.0       성인
7   2.0     미성년자
8  27.0       성인
9  14.0     미성년자

In [60]:
#DataFrame.apply를 사용한 가족 규모 계산

# 각 행(row)에 대해 SibSp + Parch + 1 계산
titanic_df['FamilySize'] = titanic_df.apply(lambda row: row['SibSp'] + row['Parch'] + 1, axis=1)
print(titanic_df[['SibSp', 'Parch', 'FamilySize']].head(5))

   SibSp  Parch  FamilySize
0      1      0           2
1      1      0           2
2      0      0           1
3      1      0           2
4      0      0           1

1. **퀴즈 1:** **객실등급(Pclass)** 값을 **일등석/이등석/삼등석** 등의 문자열로 변환한 새로운 열 `PclassLabel`을 추가해보세요. (예: 1 -> "1등석", 2 -> "2등석", 3 -> "3등석") `map`을 사용하면 편리합니다.
2. **퀴즈 2:** **이름(Name)의 길이**를 계산하여 새로운 열 `NameLength`에 저장해보세요. (`len()` 함수를 `apply`로 적용하거나, Pandas의 문자열 기능으로 쉽게 구할 수 있습니다.)

In [61]:
# 퀴즈 1 정답: Pclass를 등석 문자열로 매핑
titanic_df['PclassLabel'] = titanic_df['Pclass'].map({1: '1등석', 2: '2등석', 3: '3등석'})
print(titanic_df[['Pclass', 'PclassLabel']].head(5))

# 퀴즈 2 정답: Name 길이 계산하여 새로운 열 저장
titanic_df['NameLength'] = titanic_df['Name'].apply(lambda x: len(x))
# (또는 titanic_df['Name'].str.len()으로도 동일한 결과를 얻을 수 있습니다.)
print(titanic_df[['Name', 'NameLength']].head(3))

   Pclass PclassLabel
0       3         3등석
1       1         1등석
2       3         3등석
3       1         1등석
4       3         3등석
                                                Name  NameLength
0                            Braund, Mr. Owen Harris          23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...          51
2                             Heikkinen, Miss. Laina          22

set_index / reset_index

In [62]:
#set_index
df_idx = titanic_df.set_index("PassengerId")

In [63]:
#reset_index
df_back = df_idx.reset_index()

퀴...즈...

In [64]:
#PassengerId를 인덱스로 설정한 뒤, PassengerId=10 승객의 Name, Age, Fare를 출력해라

df_idx = titanic_df.set_index("PassengerId")
df_idx.loc[10, ["Name","Age","Fare"]]

Name    Nasser, Mrs. Nicholas (Adele Achem)
Age                                    14.0
Fare                                30.0708
Name: 10, dtype: object

In [65]:
#set_index("PassengerId") 할 때, PassengerId 컬럼이 사라지는 게 싫다. 어떻게 할까?

df_idx_keep = titanic_df.set_index("PassengerId", drop=False)   #drop=False
df_idx_keep.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,LastName,BoardTime,BoardDate,TimeSinceFirst,HoursSinceFirst,SurvivalStatus,AgeGroup,FamilySize,PclassLabel,NameLength
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,Owen Harris,1912-04-10 12:00:00,1912-04-10,0 days 00:00:00,0.0,사망,성인,2,3등석,23
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,John Bradley (Florence Briggs Thayer),1912-04-10 18:00:00,1912-04-10,0 days 06:00:00,6.0,생존,성인,2,1등석,51
3,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,Laina,1912-04-10 12:00:00,1912-04-10,0 days 00:00:00,0.0,생존,성인,1,3등석,22
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,Jacques Heath (Lily May Peel),1912-04-10 12:00:00,1912-04-10,0 days 00:00:00,0.0,생존,성인,2,1등석,44
5,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,William Henry,1912-04-10 12:00:00,1912-04-10,0 days 00:00:00,0.0,사망,성인,1,3등석,24

In [66]:
#아래 표는 Pclass가 인덱스다. Pclass를 다시 컬럼으로 빼고 싶다.
table = titanic_df.pivot_table(values="Survived", index="Pclass", columns="Sex", aggfunc="mean")

table.reset_index()   #reset_index

Sex  Pclass    female      male
0         1  0.968085  0.368852
1         2  0.921053  0.157407
2         3  0.500000  0.135447

In [67]:
import numpy as np
df = pd.DataFrame(
    {'country': ['Italy', 'Portugal', 'US', 'US'],
     'province' : ['Sicily & Sardinia', 'Douro', 'California', 'New York'],
     'region_1' : ['Etna', np.nan, 'Napa Valley', 'Finger Lakes'],
     'region_2' : [np.nan, np.nan, 'Napa', 'Finger Lakes']}
)
df

df.index = [0, 1, 10, 100]
df

      country           province      region_1      region_2
0       Italy  Sicily & Sardinia          Etna           NaN
1    Portugal              Douro           NaN           NaN
10         US         California   Napa Valley          Napa
100        US           New York  Finger Lakes  Finger Lakes

In [68]:
# cols = ['country', 'province', 'region_1', 'region_2']
# indices = [0, 1, 10, 100]
# df = reviews.loc[indices, cols]

In [69]:
df['variety'] = 'A'
df

      country           province      region_1      region_2 variety
0       Italy  Sicily & Sardinia          Etna           NaN       A
1    Portugal              Douro           NaN           NaN       A
10         US         California   Napa Valley          Napa       A
100        US           New York  Finger Lakes  Finger Lakes       A

In [70]:
# df.loc[df['country', 'variety']].head(1000)

In [71]:
# cols = ['country', 'variety']
# df = reviews.loc[:99, cols]
# or

# cols_idx = [0, 11]
# df = reviews.iloc[:100, cols_idx]

In [72]:
#italian_wines = reviews[reviews['country'] == 'Italy']

In [73]:
# top_oceania_wines = reviews[(reviews['country'].isin(['Australia', 'New Zealand'])) & (reviews['points'] >= 95)]